%==========================================================================
%
% 函数名：pillar
% 函数介绍： 画d_基因个数柱图。d是一个列向量。
% 输入参数： d是基因的权重。
%           r1是第一组样本的个数。
%           r2是第二组样本的个数。
% 输出参数： alfa是柱图纵轴的突跳点。
%           y是柱图中每根柱的高，是基因的分布情况＝对应每个横轴区间的基因个数。
%
%==========================================================================
function [ alfa, y ] = pillar ( d, r1, r2 )
[m, n] = size ( d );
A = min ( d );
B = max ( d );
fenshu = round ( 1.87 * (( r1 + r2 - 1 ) ^ 0.4 )) + 1;
t = ( B - A ) / fenshu;
f = A + t / 2 : t : B - t / 2;
x = A : t : B;
%==============================

% 求直方图的高。
[y] = hight ( x, d, fenshu, m );

%==============================
% 画柱图。
bar ( f, y, 'k' );%黑色柱图
ylabel ('基因个数');
xlabel ('基因分类权重');
%==============================

% 确定基因个数突跳点。
[alfa] = sharp_jump ( f, y, fenshu, t );
%==============================
% end

